[
    [
        [
            [
                "The Ranger",
                "Spell Slots per Spell Level"
            ],
            [
                "Level",
                "Proficiency Bonus",
                "Features",
                "Spells Known",
                "1st",
                "2nd",
                "3rd",
                "4th",
                "5th"
            ],
            [
                "1st",
                "+2",
                "Favored Enemy, Natural Explorer, Deft Explorer( Optional), Favored Foe( Optional)",
                "-",
                "-",
                "-",
                "-",
                "-",
                "-"
            ],
            [
                "2nd",
                "+2",
                "Fighting Style, Spellcasting, Spellcasting Focus( Optional)",
                "2",
                "2",
                "-",
                "-",
                "-",
                "-"
            ],
            [
                "3rd",
                "+2",
                "Primeval Awareness, Ranger Conclave, Primal Awareness( Optional)",
                "3",
                "3",
                "-",
                "-",
                "-",
                "-"
            ],
            [
                "4th",
                "+2",
                "Ability Score Improvement, Martial Versatility( Optional)",
                "3",
                "3",
                "-",
                "-",
                "-",
                "-"
            ],
            [
                "5th",
                "+3",
                "Extra Attack",
                "4",
                "4",
                "2",
                "-",
                "-",
                "-"
            ],
            [
                "6th",
                "+3",
                "Favored Enemy Improvement, Natural Explorer Improvement, Deft Explorer Improvement( Optional)",
                "4",
                "4",
                "2",
                "-",
                "-",
                "-"
            ],
            [
                "7th",
                "+3",
                "Ranger Conclave feature",
                "5",
                "4",
                "3",
                "-",
                "-",
                "-"
            ],
            [
                "8th",
                "+3",
                "Ability Score Improvement, Land 's Stride, Martial Versatility( Optional)",
                "5",
                "4",
                "3",
                "-",
                "-",
                "-"
            ],
            [
                "9th",
                "+4",
                "",
                "6",
                "4",
                "3",
                "2",
                "-",
                "-"
            ],
            [
                "10th",
                "+4",
                "Natural Explorer Improvement, Hide in Plain Sight, Deft Explorer Feature( Optional), Nature 's Veil( Optional)",
                "6",
                "4",
                "3",
                "2",
                "-",
                "-"
            ],
            [
                "11th",
                "+4",
                "Ranger Conclave feature",
                "7",
                "4",
                "3",
                "3",
                "-",
                "-"
            ],
            [
                "12th",
                "+4",
                "Ability Score Improvement, Martial Versatility( Optional)",
                "7",
                "4",
                "3",
                "3",
                "-",
                "-"
            ],
            [
                "13th",
                "+5",
                "",
                "8",
                "4",
                "3",
                "3",
                "1",
                "-"
            ],
            [
                "14th",
                "+5",
                "Favored Enemy Improvement, Vanish",
                "8",
                "4",
                "3",
                "3",
                "1",
                "-"
            ],
            [
                "15th",
                "+5",
                "Ranger Conclave feature",
                "9",
                "4",
                "3",
                "3",
                "2",
                "-"
            ],
            [
                "16th",
                "+5",
                "Ability Score Improvement, Martial Versatility( Optional)",
                "9",
                "4",
                "3",
                "3",
                "2",
                "-"
            ],
            [
                "17th",
                "+6",
                "",
                "10",
                "4",
                "3",
                "3",
                "3",
                "1"
            ],
            [
                "18th",
                "+6",
                "Feral Senses",
                "10",
                "4",
                "3",
                "3",
                "3",
                "1"
            ],
            [
                "19th",
                "+6",
                "Ability Score Improvement, Martial Versatility( Optional)",
                "11",
                "4",
                "3",
                "3",
                "3",
                "2"
            ],
            [
                "20th",
                "+6",
                "Foe Slayer",
                "11",
                "4",
                "3",
                "3",
                "3",
                "2"
            ]
        ],
        [
            "Class Features",
            "As a ranger, you gain the follow class feature.",
            "Hit Dice: 1d10 per ranger level Hit Points at 1st Level: 10+ your Constitution modifier Hit Points at Higher Levels: 1d10( or 6)+ your Constitution modifier per ranger level after 1st",
            "Armor: Light armor, medium armor, shield Weapons: Simple weapon, martial weapon Tools: None Saving Throws: Strength, Dexterity Skills: Choose three from Animal Handling, Athletics, Insight, Investigation, Nature, Perception, Stealth, and Survival",
            "You start with the follow equipment, in addition to the equipment grant by your background:",
            [
                "( a) scale mail or( b) leather armor",
                "( a) two shortswords or( b) two simple melee weapon",
                "( a) a dungeoneer 's pack or( b) an explorer 's pack",
                "A longbow and a quiver of 20 arrow"
            ]
        ],
        [
            "Favored Enemy",
            "Beginning at 1st level, you have significant experience study, track, hunt, and even talk to a certain type of enemy.",
            "Choose a type of favor enemy: aberration, beast, celestials, construct, dragon, elementals, fey, fiend, giant, monstrosity, ooze, plant, or undead. Alternatively, you can select two race of humanoid( such a gnolls and orcs) a favor enemy.",
            "You have advantage on Wisdom( Survival) check to track your favor enemy, a well a on Intelligence check to recall information about them.",
            "When you gain this feature, you also learn one language of your choice that be spoken by your favor enemy, if they speak one at all.",
            "You choose one additional favor enemy, a well a an associate language, at 6th and 14th level. As you gain level, your choice should reflect the type of monster you have encounter on your adventure."
        ],
        [
            "Favored Foe( Optional)",
            "This 1st-level feature replaces the Favored Enemy feature and work with the Foe Slayer feature. You gain no benefit from the replace feature and do n't qualify for anything in the game that require it.",
            "When you hit a creature with an attack roll, you can call on your mystical bond with nature to mark the target a your favor enemy for 1 minute or until you lose your concentration( a if you be concentrate on a spell).",
            "The first time on each of your turn that you hit the favor enemy and deal damage to it, include when you mark it, you increase that damage by 1d4.",
            "You can use this feature to mark a favor enemy a number of time equal to your proficiency bonus, and you regain all expend us when you finish a long rest.",
            "This feature 's extra damage increase when you reach certain level in this class: to 1d6 at 6th level and to 1d8 at 14th level."
        ],
        [
            "Natural Explorer",
            "Also at 1st level, you be particularly familiar with one type of natural environment and be adept at travel and survive in such region. Choose one type of favor terrain: arctic, coast, desert, forest, grassland, mountain, swamp, or the Underdark. When you make an Intelligence or Wisdom check related to your favor terrain, your proficiency bonus be double if you be use a skill that you ’ re proficient in.",
            "While travel for an hour or more in your favor terrain, you gain the follow benefit:",
            [
                "Difficult terrain doesn ’ t slow your group ’ s travel.",
                "Your group can ’ t become lose except by magical mean.",
                "Even when you be engage in another activity while travel( such a forage, navigate, or track), you remain alert to danger.",
                "If you be travel alone, you can move stealthily at a normal pace.",
                "When you forage, you find twice a much food a you normally would.",
                "While track other creature, you also learn their exact number, their size, and how long ago they pass through the area."
            ],
            "You choose additional favor terrain type at 6th and 10th level."
        ],
        [
            "Deft Explorer( Optional)",
            "This 1st-level feature replaces the Natural Explorer feature. You gain no benefit from the replace feature and do n't qualify for anything in the game that require it.",
            "You be an unsurpassed explorer and survivor, both in the wilderness and in deal with others on your travel. You gain the Canny benefit below, and you gain an additional benefit when you reach 6th level and 10th level in this class.",
            "Choose one of your skill proficiency. Your proficiency bonus be double for any ability check you make use the chosen skill.",
            "You can also speak, read, and write 2 additional language of your choice.",
            "Your walk speed increase by 5, and you gain a climb speed and a swim speed equal to your walk speed.",
            "As an action, you can give yourself a number of temporary hit point equal to 1d8+ your Wisdom modifier( minimum of 1 temporary hit point). You can use this action a number of time equal to your proficiency bonus, and you regain all expend us when you finish a long rest.",
            "In addition, whenever you finish a short rest, your exhaustion level, if any, be decrease by 1."
        ],
        [
            "Fighting Style",
            "At 2nd level, you adopt a particular style of fight a your specialty. Choose one of the follow option. You ca n't take a Fighting Style option more than once, even if you later get to choose again.",
            [
                "Archery. You gain a +2 bonus to attack roll you make with range weapon."
            ],
            [
                "Blind Fighting. You have blind sight with a range of 10 foot. Within that range, you can effectively see anything that be n't behind total cover, even if you 're blind or in darkness. Moreover, you can see an invisible creature within that range, unless the creature successfully hide from you."
            ],
            [
                "Defense. While you be wear armor, you gain a +1 bonus to AC."
            ],
            [
                "Druidic Warrior. You learn two cantrips of your choice from the Druid spell list. They count a ranger spell for you, and Wisdom be your spellcasting ability for them. Whenever you gain a level in this class, you can replace one of these cantrips with another cantrip from the Druid spell list."
            ],
            [
                "Dueling. When you be wield a melee weapon in one hand and no other weapon, you gain a +2 bonus to damage roll with that weapon."
            ],
            [
                "Thrown Weapon Fighting. You can draw a weapon that have the thrown property a part of the attack you make with the weapon. In addition, when you hit with a range attack use a thrown weapon, you gain a +2 bonus to the damage roll."
            ],
            [
                "In addition, when you hit with a range attack use a thrown weapon, you gain a +2 bonus to the damage roll."
            ],
            [
                "Two-Weapon Fighting. When you engage in two-weapon fight, you can add your ability modifier to the damage of the second attack."
            ],
            [
                "Close Quarters Shooter( UA). When make a range attack while you be within 5 foot of a hostile creature, you do not have disadvantage on the attack roll. Your range attack ignore half cover and three-quarters cover against target within 30 foot of you. You have a +1 bonus to attack roll on range attack."
            ],
            [
                "Interception( UA). When a creature you can see hit a target that be within 5 foot of you with an attack, you can use your reaction to reduce the damage the target take by 1d10+ your proficiency bonus( to a minimum of 0 damage). You must be wield a shield or a simple or martial weapon to use this reaction."
            ],
            [
                "Mariner( UA). As long a you be not wear heavy armor or use a shield, you have a swim speed and a climb speed equal to your normal speed, and you gain a +1 bonus to armor class."
            ],
            [
                "Tunnel Fighter( UA). As a bonus action, you can enter a defensive stance that last until the start of your next turn. While in your defensive stance, you can make opportunity attack without use your reaction, and you can use your reaction to make a melee attack against a creature that move more than 5 foot while within your reach."
            ],
            [
                "Unarmed Fighting( UA). Your unarmed strike can deal bludgeoning damage equal to 1d6+ your Strength modifier. If you strike with two free hand, the d6 becomes a d8. When you successfully start a grapple, you can deal 1d4 bludgeoning damage to the grapple creature. Until the grapple end, you can also deal this damage to the creature whenever you hit it with a melee attack."
            ],
            [
                "When you successfully start a grapple, you can deal 1d4 bludgeoning damage to the grapple creature. Until the grapple end, you can also deal this damage to the creature whenever you hit it with a melee attack."
            ]
        ],
        [
            "Spellcasting",
            "By the time you reach 2nd level, you have learn to use the magical essence of nature to cast spell, much a a druid do.",
            "The Ranger table show how many spell slot you have to cast your ranger spell of 1st level and high. To cast one of these spell, you must expend a slot of the spell 's level or high. You regain all expend spell slot when you finish a long rest.",
            "For example, if you know the 1st-level spell Animal Friendship and have a 1st-level and a 2nd-level spell slot available, you can cast Animal Friendship use either slot.",
            "You know two 1st-level spell of your choice from the ranger spell list.",
            "The Spells Known column of the Ranger table show when you learn more ranger spell of your choice. Each of these spell must be of a level for which you have spell slot. For instance, when you reach 5th level in this class, you can learn one new spell of 1st or 2nd level.",
            "Additionally, when you gain a level in this class, you can choose one of the ranger spell you know and replace it with another spell from the ranger spell list, which also must be of a level for which you have spell slot.",
            "Wisdom be your spellcasting ability for your ranger spell, since your magic draw on your attunement to nature. You use your Wisdom whenever a spell refers to your spellcasting ability. In addition, you use your Wisdom modifier when set the save throw DC for a ranger spell you cast and when make an attack roll with one.",
            "Spell save DC= 8+ your proficiency bonus+ your Wisdom modifier",
            "Spell attack modifier= your proficiency bonus+ your Wisdom modifier",
            "At 2nd level, you can use a druidic focus a a spellcasting focus for your ranger spell. A druidic focus might be a sprig of mistletoe or holly, a wand or rod make of yew or another special wood, a staff drawn whole from a living tree, or an object incorporate feather, fur, bone, and teeth from sacred animal."
        ],
        [
            "Primeval Awareness",
            "Beginning at 3rd level, you can use your action and expend one ranger spell slot to focus your awareness on the region around you. For 1 minute per level of the spell slot you expend, you can sense whether the follow type of creature be present within 1 mile of you( or within up to 6 mile if you be in your favor terrain): aberration, celestials, dragon, elementals, fey, fiend, and undead. This feature doesn ’ t reveal the creature ’ location or number."
        ],
        [
            [
                "Primal Awareness Spells",
                ""
            ],
            [
                "Ranger Level",
                "Spell"
            ],
            [
                "3rd",
                "Speak with Animals"
            ],
            [
                "5th",
                "Beast Sense"
            ],
            [
                "9th",
                "Speak with Plants"
            ],
            [
                "13th",
                "Locate Creature"
            ],
            [
                "17th",
                "Commune with Nature"
            ]
        ],
        [
            "Primal Awareness( Optional)",
            "This 3rd-level feature replaces the Primeval Awareness feature. You gain no benefit from the replace feature and do n't qualify for anything in the game that require it.",
            "You can focus your awareness through the interconnection of nature: you learn additional spell when you reach certain level in this class if you do n't already know them, a show in the Primal Awareness Spells table. These spell do n't count against the number of ranger spell you know.",
            "You can cast each of these spell once without expend a spell slot. Once you cast a spell in this way, you ca n't do so again until you finish a long rest."
        ],
        [
            [
                "Conclave",
                "Source"
            ],
            [
                "Beast Master",
                "Player 's Handbook"
            ],
            [
                "Fey Wanderer",
                "Tasha 's Cauldron of Everything"
            ],
            [
                "Gloom Stalker",
                "Xanathar 's Guide to Everything"
            ],
            [
                "Horizon Walker",
                "Xanathar 's Guide to Everything"
            ],
            [
                "Hunter",
                "Player 's Handbook"
            ],
            [
                "Monster Slayer",
                "Xanathar 's Guide to Everything"
            ],
            [
                "Swarmkeeper",
                "Tasha 's Cauldron of Everything"
            ],
            [
                "Drakewarden",
                "Fizban 's Treasury of Dragons"
            ]
        ],
        [
            "Ranger Conclave",
            "At 3rd level, you choose to emulate the ideal and training of a ranger conclave. Your choice grant you feature at 3rd level and again at 7th, 11th, and 15th level."
        ],
        [
            "Ability Score Improvement",
            "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability score of your choice by 1. As normal, you ca n't increase an ability score above 20 use this feature."
        ],
        [
            "Martial Versatility( Optional)",
            "Whenever you reach a level in this class that grant the Ability Score Improvement feature, you can replace a fight style you know with another fight style available to ranger. This replacement represent a shift of focus in your martial practice."
        ],
        [
            "Extra Attack",
            "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn."
        ],
        [
            "Land 's Stride",
            "Starting at 8th level, move through nonmagical difficult terrain cost you no extra movement. You can also pas through nonmagical plant without be slow by them and without take damage from them if they have thorn, spine, or a similar hazard.",
            "In addition, you have advantage on save throw against plant that be magically create or manipulate to impede movement, such a those create by the Entangle spell."
        ],
        [
            "Hide in Plain Sight",
            "Starting at 10th level, you can spend 1 minute create camouflage for yourself. You must have access to fresh mud, dirt, plant, soot, and other naturally occur material with which to create your camouflage.",
            "Once you be camouflage in this way, you can try to hide by press yourself up against a solid surface, such a a tree or wall, that be at least a tall and wide a you be. You gain a +10 bonus to Dexterity( Stealth) check a long a you remain there without move or take action. Once you move or take an action or a reaction, you must camouflage yourself again to gain this benefit."
        ],
        [
            "Nature 's Veil( Optional)",
            "This 10th-level feature replaces the Hide in Plain Sight feature. You gain no benefit from the replace feature and do n't qualify for anything in the game that require it.",
            "You draw on the power of nature to hide yourself from view briefly. As a bonus action, you can magically become invisible, along with any equipment you be wear or carry, until the start of your next turn.",
            "You can use this feature a number of time equal to your proficiency bonus, and you regain all expend us when you finish a long rest."
        ],
        [
            "Vanish",
            "Starting at 14th level, you can use the Hide action a a bonus action on your turn. Also, you ca n't be tracked by nonmagical mean, unless you choose to leave a trail."
        ],
        [
            "Feral Senses",
            "At 18th level, you gain preternatural sens that help you fight creature you ca n't see. When you attack a creature you ca n't see, your inability to see it do n't impose disadvantage on your attack roll against it.",
            "You be also aware of the location of any invisible creature within 30 foot of you, provide that the creature be n't hidden from you and you be n't blind or deafen."
        ]
    ],
    []
]