[
    [
        [
            "Player 's Handbook",
            "Elves be a magical people of otherworldly grace, living in place of ethereal beauty, in the midst of ancient forest or in silvery spire glitter with faerie light, where soft music drift through the air and gentle fragrance waft on the breeze. Elves love nature and magic, art and artistry, music and poetry.",
            [
                "Ability Score Increase. Your Dexterity score increase by 2."
            ],
            [
                "Age. Although elf reach physical maturity at about the same age a human, the elven understand of adulthood go beyond physical growth to encompass worldly experience. An elf typically claim adulthood and an adult name around the age of 100 and can live to be 750 year old."
            ],
            [
                "Alignment. Elves love freedom, variety, and self-expression, so they lean strongly towards the gentler aspect of chaos. They value and protect others' freedom a well a their own, and be good more often than not. Drow be an exception; their exile into the Underdark have make them vicious and dangerous. Drow be more often evil than not."
            ],
            [
                "Size. Elves range from under 5 to over 6 foot tall and have slender build. Your size be Medium."
            ],
            [
                "Speed. Your base walk speed be 30 foot."
            ],
            [
                "Darkvision. Accustomed to twilit forest and the night sky, you have superior vision in dark and dim condition. You can see in dim light within 60 foot of you a if it be bright light, and in darkness a if it be dim light. You ca n't discern color in darkness, only shade of gray."
            ],
            [
                "Fey Ancestry. You have advantage on save throw against be charm, and magic ca n't put you to sleep."
            ],
            [
                "Trance. Elves do not sleep. Instead they meditate deeply, remain semi-conscious, for 4 hour a day. The Common word for this meditation be `` trance. '' While meditate, you dream after a fashion; such dream be actually mental exercise that have become reflexive after year of practice. After rest in this way, you gain the same benefit a human would from 8 hour of sleep."
            ],
            [
                "Keen Senses. You have proficiency in the Perception skill."
            ],
            [
                "Languages. You can speak, read, and write Common and Elven."
            ],
            "Dark Elf",
            "Descended from an earlier subrace of dark-skinned elf, the drow be banish from the surface world for follow the goddess Lolth down the path to evil and corruption. Now they have built their own civilization in the depth of the Underdark, pattern after the Way of Lolth. Also call dark elf. The drow have black skin that resembles polished obsidian and stark white or pale yellow hair. They commonly have very pale eye( so pale a to be mistaken for white) in shade of lilac, silver, pink, red, and blue. They lend to be small and thinner than most elf.",
            "Drow adventurer be rare, and the race do not exist in all world. Check with your Dungeon Master to see if you can play a drow character.",
            [
                "Ability Score Increase. Your Charisma score increase by 1."
            ],
            [
                "Superior Darkvision. Your darkvision have a range of 120 foot, instead of 60."
            ],
            [
                "Sunlight Sensitivity. You have disadvantage on attack roll and Wisdom( Perception) check that rely on sight when you, the target of the attack, or whatever you be try to perceive be in direct sunlight."
            ],
            [
                "Drow Magic. You know the Dancing Lights cantrip. When you reach 3rd level, you can cast the Faerie Fire spell once with this trait and regain the ability to do so when you finish a long rest. When you reach 5th level, you can cast the Darkness spell once and regain the ability to do so when you finish a long rest. Charisma be your spellcasting ability for these spell."
            ],
            [
                "Drow Weapon Training. You have proficiency with rapier, shortswords, and hand crossbow."
            ],
            "High Elf",
            "As a high elf, you have a keen mind and a mastery of at least the basic of magic. In many of the world of D& D, there be two kind of high elf. One type( which include the gray elf and valley elf of Greyhawk, the Silvanesti of Dragonlance, and the sun elf of the Forgotten Realms) be haughty and reclusive, believe themselves to be superior to non-elves and even other elf. The other type( include the high elf of Greyhawk. the Qualinesti of Dragonlance, and the moon elf of the Forgotten Realms) be more common and more friendly, and often encounter among human and other race.",
            "The sun elf of Faerun( also call gold elf or sunrise elf) have bronze skin and hair of copper, black, or golden blood. Their eye be golden, silver, or black. Moon elf( also call silver elf or gray elf) be much paler, with alabaster skin sometimes ting with blue. They often have hair of silver-while, black, or blue, but various shade of blond, brown, and red be not uncommon. Their eye be blue or green and fleck with gold.",
            [
                "Ability Score Increase. Your Intelligence score increase by 1."
            ],
            [
                "Cantrip. You know one cantrip of your choice from the Wizard spell list. Intelligence be your spellcasting ability for it."
            ],
            [
                "Elf Weapon Training. You have proficiency with the longsword, shortsword, shortbow, and longbow."
            ],
            [
                "Extra Language. You can read, speak, and write one additional language of your choice."
            ],
            "Wood Elf",
            "As a wood elf, you have keen sens and intuition, and your fleet foot carry you quickly and stealthily through your native forest. This category include the wild elf( grugach) of Greyhawk and the Kagonesti of Dragonlance, a well a the race call wood elf in Greyhawk and the Forgotten Realms. In Faerun, wood elf( also call wild elf. green elf, or forest elf) be reclusive and distrust of non-elves.",
            "Wood elf' skin tends to be copperish in hue, sometimes with trace of green. Their hair tends toward brown and black, but it be occasionally blond or copper-colored. Their eye be green, brown, or hazel.",
            [
                "Ability Score Increase. Your Wisdom score increase by 1."
            ],
            [
                "Elf Weapon Training. You have proficiency with the longsword, shortsword, shortbow, and longbow."
            ],
            [
                "Fleet of Foot. Your base walk speed increase to 35 foot."
            ],
            [
                "Mask of the Wild. You can attempt to hide even when you be only lightly obscure by foliage, heavy rain, fall snow, mist, and other natural phenomenon."
            ]
        ]
    ],
    []
]