[
    [
        [
            "Player 's Handbook",
            "Walking in two world but truly belonging to neither, half-elves combine what some say be the best quality of their elf and human parent: human curiosity, inventiveness, and ambition temper by the refine sens, love of nature, and artistic taste of the elf.",
            [
                "Ability Score Increase. Your Charisma score increase by 2, and two other ability score of your choice each increase by 1."
            ],
            [
                "Age. Half-elves age at much the same rate a human, reach adulthood at the age of 20. They live much longer than human, however, often exceed 180 year."
            ],
            [
                "Alignment. Half-elves share the chaotic bent of their elven heritage. They both value personal freedom and creative expression, demonstrate neither love of leader nor desire for follower. They chafe at rule, resent others' demand, and sometimes prove unreliable, or at least unpredictable. They be good and evil in equal number, a trait they share with their human parent."
            ],
            [
                "Size. Half-elves be more or less the same size a human, range from 5 to 6 foot tall. Your size be Medium."
            ],
            [
                "Speed. Your base walk speed be 30 foot."
            ],
            [
                "Darkvision. Thanks to your elven heritage, you have superior vision in dark and dim condition. You can see in dim light within 60 foot of you a if it be bright light, and in darkness a if it be dim light. You ca n't discern color in darkness, only shade of gray."
            ],
            [
                "Fey Ancestry. You have advantage on save throw against be charm, and magic ca n't put you to sleep."
            ],
            [
                "Languages. You can read, speak, and write Common, Elven, and one language of your choice."
            ],
            [
                "Half-Elf Versatility. Choose one of the follow trait: Skill Versatility( General). You gain proficiency in two skill of your choice. Elf Weapon Training( High or Wood Elf Heritage). You have proficiency with the longsword, shortsword, shortbow, and longbow. Cantrip( High Elf Heritage). You know one cantrip of your choice from the wizard spell list. Intelligence be your spellcasting ability for it. Fleet of Foot( Wood Elf Heritage). Your base walk speed increase to 35 foot. Mask of the Wild( Wood Elf Heritage). You can attempt to hide even when you be only lightly obscure by foliage, heavy rain, fall snow, mist, and other natural phenomenon. Drow Magic( Dark Elf Heritage). You know the Dancing Lights cantrip. When you reach 3rd level, you can cast Faerie Fire once, and it recharges after a long rest. When you reach 5th level, you can cast Darkness once, and it recharges after a long rest. Charisma be your spellcasting ability for these spell. Swim Speed( Aquatic Elf Heritage). You have a swim speed of 30 foot."
            ],
            [
                "Skill Versatility( General). You gain proficiency in two skill of your choice.",
                "Elf Weapon Training( High or Wood Elf Heritage). You have proficiency with the longsword, shortsword, shortbow, and longbow.",
                "Cantrip( High Elf Heritage). You know one cantrip of your choice from the wizard spell list. Intelligence be your spellcasting ability for it.",
                "Fleet of Foot( Wood Elf Heritage). Your base walk speed increase to 35 foot.",
                "Mask of the Wild( Wood Elf Heritage). You can attempt to hide even when you be only lightly obscure by foliage, heavy rain, fall snow, mist, and other natural phenomenon.",
                "Drow Magic( Dark Elf Heritage). You know the Dancing Lights cantrip. When you reach 3rd level, you can cast Faerie Fire once, and it recharges after a long rest. When you reach 5th level, you can cast Darkness once, and it recharges after a long rest. Charisma be your spellcasting ability for these spell.",
                "Swim Speed( Aquatic Elf Heritage). You have a swim speed of 30 foot."
            ]
        ]
    ],
    []
]