[
    [
        "Player 's Handbook",
        "When alliance between human and orcs be seal by marriage, half-orcs be born. Some half-orcs rise to become proud chief of orc tribe, their human blood give them an edge over their full-blooded orc rival. Some venture into the world to prove their worth among human and other more civilize race. Many of these become adventurer, achieve greatness for their mighty deed and notoriety for their barbaric custom and savage fury.",
        [
            "Ability Score Increase. Your Strength score increase by 2, and your Constitution score increase by 1."
        ],
        [
            "Age. Half-orcs mature a little faster than human, reach adulthood around age 14. They age noticeably faster and rarely live longer than 75 year."
        ],
        [
            "Alignment. Half-orcs inherit a tendency toward chaos from their orc parent and be not strongly inclined toward good. Half-orcs raise among orcs and willing to live out their life among them be usually evil."
        ],
        [
            "Size. Half-orcs be somewhat large and bulkier than human, and they range from 5 to well over 6 foot tall. Your size be Medium."
        ],
        [
            "Speed. Your base walk speed be 30 foot."
        ],
        [
            "Darkvision. Thanks to your orc blood, you have superior vision in dark and dim condition. You can see in dim light within 60 foot of you a if it be bright light, and in darkness a if it be dim light. You ca n't discern color in darkness, only shade of gray."
        ],
        [
            "Menacing. You gain proficiency in the Intimidation skill."
        ],
        [
            "Relentless Endurance. When you be reduce to 0 hit point but not kill outright, you can drop to 1 hit point instead. You ca n't use this feature again until you finish a long rest."
        ],
        [
            "Savage Attacks. When you score a critical hit with a melee weapon attack, you can roll one of the weapon 's damage dice one additional time and add it to the extra damage of the critical hit."
        ],
        [
            "Languages. You can speak, read, and write Common and Orc. Orc be a harsh, grate language with hard consonant. It have no script of it own but be write in the Dwarvish script."
        ]
    ],
    []
]