[
    [
        "Player 's Handbook",
        "In the reckoning of most world, human be the young of the common race, late to arrive on the world scene and short-lived in comparison to dwarf, elf, and dragon. Perhaps it be because of their shorter life that they strive to achieve a much a they can in the year they be give. Or maybe they feel they have something to prove to the elder race, and that 's why they build their mighty empire on the foundation of conquest and trade. Whatever drive them, human be the innovator, the achiever, and the pioneer of the world.",
        [
            "Ability Score Increase. Your ability score each increase by 1."
        ],
        [
            "Age. Humans reach adulthood in their late teen and live less than a century."
        ],
        [
            "Alignment. Humans tend toward no particular alignment. The best and the bad be found among them."
        ],
        [
            "Size. Humans vary widely in height and build, from barely 5 foot to well over 6 foot tall. Regardless of your position in that range, your size be Medium."
        ],
        [
            "Speed. Your base walk speed be 30 foot."
        ],
        [
            "Languages. You can speak, read, and write Common and one extra language of your choice. Humans typically learn the language of other people they deal with, include obscure dialect. They be fond of sprinkle their speech with word borrow from other tongue: Orc curse, Elvish musical expression, Dwarvish military phrase, and so on."
        ],
        "Variant",
        "If your campaign us the optional feat rule from chapter 5 of the Player 's Handbook, your Dungeon Master might allow these variant trait, all of which replace the human 's Ability Score Increase trait.",
        [
            "Ability Score Increase. Two different ability score of your choice increase by 1."
        ],
        [
            "Skills. You gain proficiency in one skill of your choice."
        ],
        [
            "Feat. You gain one Feat of your choice."
        ]
    ],
    []
]