[
    [
        "Player 's Handbook",
        "To be greet with stare and whisper, to suffer violence and insult on the street, to see mistrust and fear in every eye: this be the lot of the tiefling. And to twist the knife, tieflings know that this be because a pact struck generation ago infuse the essence of Asmodeus, overlord of the Nine Hells( and many of the other powerful devil serve under him) into their bloodline. Their appearance and their nature be not their fault but the result of an ancient sin, for which they and their child and their child 's child will always be held accountable.",
        [
            "Ability Score Increase. Your Charisma score increase by 2."
        ],
        [
            "Age. Tieflings mature at the same rate a human but live a few year longer."
        ],
        [
            "Alignment. Tieflings might not have an innate tendency toward evil, but many of them end up there. Evil or not, an independent nature incline many tieflings toward a chaotic alignment."
        ],
        [
            "Size. Tieflings be about the same size and build a human. Your size be Medium."
        ],
        [
            "Speed. Your base walk speed be 30 foot."
        ],
        [
            "Darkvision. Thanks to your infernal heritage, you have superior vision in dark and dim condition. You can see in dim light within 60 foot of you a if it be bright light, and in darkness a if it be dim light. You can ’ t discern color in darkness, only shade of gray."
        ],
        [
            "Hellish Resistance. You have resistance to fire damage."
        ],
        [
            "Languages. You can speak, read, and write Common and Infernal."
        ],
        "Bloodline of Asmodeus",
        "The tieflings connect to Nessus command the power of fire and darkness, guide by a keener than normal intellect, a befits those link to Asmodeus himself.",
        [
            "Ability Score Increase. Your Intelligence score increase by 1."
        ],
        [
            "Infernal Legacy. You know the Thaumaturgy cantrip. Once you reach 3rd level, you can cast the Hellish Rebuke spell once a a 2nd-level spell. Once you reach 5th level, you can also cast the Darkness spell once. You must finish a long rest to cast these spell again with this trait. Charisma be your spellcasting ability for these spell."
        ]
    ],
    []
]